<template>
	<v-chip :color="status.color">{{ status.name }}</v-chip>
</template>

<script setup>
import { ref } from 'vue'

const statuses = [
	{
		value: 'DELIVERY',
		name: 'Доставка',
		color: 'gray',
		desk: 'Ваш заказ обрабатывается модераторами, после выкупа с вас спишется сумма за доставку и товар. В случае нехватки денег с вами свяжется оператор',
	},
	{
		value: 'REDEMPTION',
		name: 'Выкуп',
		color: 'gray',
		desk: 'Ваш заказ обрабатывается модераторами, после выкупа с вас спишется сумма за доставку и товар. В случае нехватки денег с вами свяжется оператор',
	},
	{
		value: 'PROCESSING',
		name: 'В обработке',
		color: 'gray',
		desk: 'Ваш заказ обрабатывается модераторами, после выкупа с вас спишется сумма за доставку и товар. В случае нехватки денег с вами свяжется оператор',
	},
	{
		value: 'PENDING_PAYMENT',
		name: 'Ожидает оплаты',
		color: '#304ffe',
		desk: 'Ваш заказ обрабатывается модераторами, после выкупа с вас спишется сумма за доставку и товар. В случае нехватки денег с вами свяжется оператор',
	},
	{
		value: 'PAID',
		name: 'Оплачен',
		color: '#304ffe',
		desk: 'Ваш заказ обрабатывается модераторами, после выкупа с вас спишется сумма за доставку и товар. В случае нехватки денег с вами свяжется оператор',
	},
	{
		value: 'WAREHOUSE_USA',
		name: 'На складе в США',
		color: 'red',
		desk: 'Ваш заказ обрабатывается модераторами, после выкупа с вас спишется сумма за доставку и товар. В случае нехватки денег с вами свяжется оператор',
	},
	{
		value: 'SHIPPED_RUSSIA',
		name: 'Отправлен в Россию',
		color: 'red',
		desk: 'Ваш заказ обрабатывается модераторами, после выкупа с вас спишется сумма за доставку и товар. В случае нехватки денег с вами свяжется оператор',
	},
	{
		value: 'REDEEMED',
		name: 'Отменён',
		color: 'red',
		desk: 'Ваш заказ обрабатывается модераторами, после выкупа с вас спишется сумма за доставку и товар. В случае нехватки денег с вами свяжется оператор',
	},
	{
		value: 'DELIVERED',
		name: 'Доставлено',
		color: 'green',
		desk: 'Ваш заказ обрабатывается модераторами, после выкупа с вас спишется сумма за доставку и товар. В случае нехватки денег с вами свяжется оператор',
	},
]

const { statusValue } = defineProps({
	statusValue: String,
})

const status = ref(statuses.find((status) => status.value === statusValue))
</script>
